app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.all.order(:name).page(params[:page]).per(15)
---
SELECT  "contacts".* FROM "contacts"  ORDER BY "contacts"."name" ASC LIMIT 15 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "contacts" LIMIT 15 OFFSET 0) subquery_for_count

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("name", "email", "kind_id", "rmk", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "sad"], ["email", "asda"], ["kind_id", 2], ["rmk", "asdasd"], ["created_at", "2017-05-17 19:35:09.477494"], ["updated_at", "2017-05-17 19:35:09.477494"]]

    def set_options_for_select
      @kind_options_for_select = Kind.all
---
SELECT "kinds".* FROM "kinds"

    def set_contact
      @contact = Contact.find(params[:id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 36]]